from collections import deque

queue = deque()

print("===================================")
print("   Симуляция очереди в банке")
print("===================================")

print("\nПриход клиентов:")

queue.append("Айдана")
print("Добавлен клиент: Айдана")

queue.append("Нурсултан")
print("Добавлен клиент: Нурсултан")

queue.append("Мадина")
print("Добавлен клиент: Мадина")

queue.append("Руслан")
print("Добавлен клиент: Руслан")

print("\nТекущая очередь:")
print(list(queue))

print("\nНачалось обслуживание клиентов:")

while queue:
    client = queue.popleft()
    print("-----------------------------------")
    print("Обслуживается клиент:", client)
    print("Осталось в очереди:", list(queue))

print("-----------------------------------")
print("Все клиенты обслужены.")
print("Очередь пуста.")
print("Работа банка завершена.")